In [1]:
%load_ext sql

In [2]:
%env DATABASE_URL=postgresql://retail_user:retail_password@localhost:5432/retail_db

env: DATABASE_URL=postgresql://retail_user:retail_password@localhost:5432/retail_db

Here are some of the examples for INNER JOIN:

Get order id, date, status and item revenue for all order items.

Get order id, date, status and item revenue for all order items for all orders where order status is either COMPLETE or CLOSED.

Get order id, date, status and item revenue for all order items for all orders where order status is either COMPLETE or CLOSED for the orders that are placed in the month of 2014 January.

In [4]:
%%sql
SELECT o.order_id, o.order_date, o.order_status, oi.order_item_subtotal
FROM orders o JOIN order_items oi 
    ON o.order_id = oi.order_item_order_id
LIMIT 10;

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 299.98),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 199.99),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 250.0),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 129.99),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 49.98),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 299.95),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 150.0),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 199.92),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 299.98),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 299.95)]

In [10]:
%%sql
SELECT o.order_id, o.order_date, o.order_status, oi.order_item_subtotal
FROM orders o JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE','CLOSED')
LIMIT 10;

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 299.98),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 49.98),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 299.95),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 150.0),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 199.92),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 299.98),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 299.95),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 99.96),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 299.98),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 129.99)]

In [13]:
%%sql

SELECT count(1)
FROM orders o JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE', 'CLOSED');

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(75408,)]

In [12]:
%%sql
SELECT o.order_id, o.order_date, o.order_status, oi.order_item_subtotal
FROM orders o JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE','CLOSED')
    AND to_char(order_date, 'yyyy-MM') = '2014-01'
LIMIT 10 ;

 * postgresql://retail_user:***@localhost:5432/retail_db
10 rows affected.

[(25882, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 299.97),
 (25882, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 100.0),
 (25882, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 79.98),
 (25882, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 399.98),
 (25888, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 299.98),
 (25889, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 99.96),
 (25889, datetime.datetime(2014, 1, 1, 0, 0), 'COMPLETE', 19.99),
 (25891, datetime.datetime(2014, 1, 1, 0, 0), 'CLOSED', 150.0),
 (25891, datetime.datetime(2014, 1, 1, 0, 0), 'CLOSED', 50.0),
 (25891, datetime.datetime(2014, 1, 1, 0, 0), 'CLOSED', 119.97)]

In [14]:
%%sql
SELECT count(1)
FROM orders o JOIN order_items oi
    ON o.order_id = oi.order_item_order_id
WHERE o.order_status IN ('COMPLETE','CLOSED')
    AND to_char(order_date, 'yyyy-MM') = '2014-01';

 * postgresql://retail_user:***@localhost:5432/retail_db
1 rows affected.

[(6198,)]